# NonContinuousRailStructure Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NonContinuousRailStructure Properties
NonContinuousRailStructure Class See Also
---
The NonContinuousRailStructure type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace